content/posts/music.md
+++
title = "Music"
author = ["Jacob Chvatal"]
lastmod = 2020-11-11T08:33:46+01:00
slug = "music"
draft = false
+++

Programming and music.


## Synthesizers {#synthesizers}


### Online {#online}

<https://synth.playtronica.com/>
<https://midi.city/>


### OP-1 {#op-1}

[OP-1 Hacks](https://github.com/op1hacks/docs)
[OP-1 Repacker](https://github.com/op1hacks/op1repacker)


### Otto :: Open source OP-1 Adjacent Project {#otto-open-source-op-1-adjacent-project}

[src](https://github.com/OTTO-project/OTTO)


### Pocket Operators {#pocket-operators}

[learn to use the PO-33](https://github.com/santiagomarcano/PO-33)


## Tools {#tools}

-   MPD
    <https://github.com/drewt/scmus>

[use game boy as midi synthesizer](https://m.youtube.com/watch?v=3jxcKPoi5Kc)
<http://nanoloop.com/mono/index.html> nanoloop synth


## Notes {#notes}

ncmpcpp is an mpt client, the frontend for mpd


### Installation {#installation}

can configure thing !

install: ncmpcpp, mopidy, mopidy-mpd, mopidy-spotify

configuration:
the mopidy service by default reads its configuration from
_etc/mopidy/mopidy.conf, not from ~_.config;

trying a symlink
symlink didn't work out
just going to start it in userspace

<!--list-separator-->

-  mopidy-spotify

    goto <https://mopidy.com/ext/spotify/#authentication> and authenticate
    its unclear how i can even search with this interface!!


### idea: dishwasher with auto soap dispenser. duh {#idea-dishwasher-with-auto-soap-dispenser-dot-duh}

[Displaying art with ncmcpp](https://github.com/ngynLk/dotfiles/tree/master/.ncmpcpp)

[configure irc bouncer so that irc clients can stay in session](https://wiki.znc.in/ZNC)


## setting up mutt for gmail {#setting-up-mutt-for-gmail}

[on using mutt](https://news.ycombinator.com/item?id=14567074)
make sure to generate an additional password for two factor auth
other than that everything is fine
mutt is not a fun user experience ....


## other configuration (TODO) {#other-configuration--todo}

set up server
host music on this server

goal configuration::

-   music streaming from custom server to local system
-   single client for all messaging platforms (matrix,irc,slack,discord.....) (matrix??)
-   rss feed from a single server (tt-rss, newsboat)
-   better autosync solution than dropbox
-   controlling things in house, different places etc
-   reproducible system configuration

[selfhosted community](https://www.reddit.com/r/selfhosted/)

-   a place to view social media easily and centralized:
-   twitter/mastodon/instagram (??)

[offlineimap](https://hobo.house/2017/07/17/using-offlineimap-with-the-gmail-imap-api/)
[bedrock linux: mix and match components from different linux distributions](https://bedrocklinux.org/)

<https://metasyn.github.io/learn-orca/#percussion>

<https://timput.com/posts/mailserver.html> self hosting email with nixos and
vultr !
<https://thedorkweb.substack.com/p/tales-from-the-dork-web-10> making a cool
thing

<https://www-cs-faculty.stanford.edu/~knuth/taocp.html> classic. may be a good
read, sounds like a waste of time right now . probably a cool gift or
something to purchase though !

<https://geekflare.com/multiple-domains-on-one-server-with-apache-nginx/>
pertinent for the server configuration

<https://beta.openai.com/> openai analysis through an api!

<https://github.com/musikinformatik/Steno> music for live coding .
<https://supercollider.github.io/> the classic live coding librar
<https://github.com/toplap/awesome-livecoding/blob/master/README.md> great
livecoding resources


## resources {#resources}

[free software instruments](https://www.spitfireaudio.com/labs/)

[music engine](https://supercollider.github.io/)
[reinventing the wheel with pytorch](https://blog.benwiener.com/programming/2019/04/29/reinventing-the-wheel.html)
[percussion machine](https://metasyn.github.io/learn-orca/#percussion)
[neat audio file editor](https://audiomass.co/)

<https://www.youtube.com/watch?v=x0BpPa72qCE&app=desktop>
<http://www.pd-tutorial.com/english/index.html>
<https://vcvrack.com/>
<https://forum.bela.io/d/1277-c-real-time-audio-programming-with-bela-a-free-online-course>
<https://www.syntorial.com/>
<https://ccrma.stanford.edu/~jos/>

<https://www.purrdata.net/>
<https://teddykoker.com/2020/05/deep-learning-for-guitar-effect-emulation/>
<https://arxiv.org/html/1202.4212>
<https://git.sr.ht/~rabbits/orca>
<https://sonic-pi.net/>
<https://www.simple.com/blog/behind-the-budget-how-to-build-your-own-synthesizer-with-simples-kelly-d>
<https://syntherjack.net/how-to-start-synth-diy/>

<https://www.gwern.net/GPT-2-music#generating-midi-with-10k30k-context-windows>
-- generating music automatically!!
<https://bjooks.com/> -- music book website
<https://www.soundonsound.com/reviews/push-turn-move> -- highly recommended; a
book written about how we interact with electronic instruments. for synth
enthusiasts and music industrial designers!
<http://everynoise.com/engenremap-vaporsoul.html>
<http://everynoise.com/engenremap-indiepoptimism.html>
<http://everynoise.com/engenremap-indiepoptimism.html>
<http://everynoise.com/retromatic.html>
<http://everynoise.com/engenremap-vaportrap.html>
<http://everynoise.com/engenremap-escaperoom.html>


### making music {#making-music}

<https://learningsynths.ableton.com/>
<https://learningmusic.ableton.com/>
<https://www.ableton.com/en/blog/ideas-offers-making-music-home/>
<https://musiclab.chromeexperiments.com/>


### making the making of music {#making-the-making-of-music}

<https://tonejs.github.io/>
<https://www.youtube.com/watch?v=JZ5yPdoPooU>
<https://www.youtube.com/watch?v=x-1%5FTEETVOA>
<https://www.reddit.com/r/synthesizers/comments/fxhogj/im%5Fa%5Fbassist%5Fand%5Fproducer%5Fand%5Fi%5Flove%5Fsynths%5Fi/>


## music {#music}

[inspiration: turning ideas into tracks](https://www.youtube.com/watch?v=ONloOhDLrFU&app=desktop)
[bitwig: linux daw](https://www.bitwig.com/en/bitwig-studio.html)
[ZzFXM Tracker synthesizer](https://keithclark.github.io/ZzFXM/tracker/?url=https://raw.githubusercontent.com/keithclark/ZzFXM/master/examples/songs/sanxion.js)
<https://codepen.io/kucerajacob/pen/GRqBQNV> drum sequencer with sample pad
[devine using orca well](https://m.youtube.com/watch?feature=youtu.be&v=OP8bsXbJlpw)
